package com.example.home_work_relativelayouttogglebuttonscrollview

class Database {
    val text = "Неудавшаяся прогулка\n"+ "\n"+
                        "Автор: Татьяна Алимова\n" +"\n"+
            "Моей мамочке уже было семьдесят восемь лет," +
            " но она была очень бодрая и живая старушка. Много двигалась, общалась с многочисленными подругами-ровесницами." +
            "Они часто встречались друг у друга, устраивали чаепития, пели старые песни, вспоминали былые времена и хвастались достижениями детей и внуков. В тёплое время года выезжали на природу, совершая достаточно длительные походы для дам их возраста.\n" +
            "Как-то я предложила маме встретиться на набережной реки, которая течёт через наш город, и прогуляться." +
            "Я приехала туда после работы, а мама должна была подъехать из дома. Жили мы вместе.\n" +
            "Я подошла четко в назначенное время. Мама опаздывала. У неё не прижился сотовый телефон, то взять с собой забудет, то возьмет, а он не заряжен. Давно уж, с полгода, телефон лежал без дела. Я подождала пять минут и заволновалась. Моя мама была очень пунктуальной всю жизнь, и на все мероприятия и встречи она предпочитала прийти пораньше.\n" +
            "Прошло ещё десять минут. Я позвонила мужу, но он сказал, что как ушёл утром из дома, так больше и не появлялся, с мамой не виделся. Мой сын тоже ничего не смог сказать, потому что мой звонок тоже застал его вне дома. Мое волнение нарастало. И полчаса спустя, мамочки не было. Вдруг откуда ни возьмись, так бывает в предгорье, налетели тучи, и пошёл сильный ливень. Зонта у меня не было." +
            "Воображение начало мне рисовать одну картину ужасней другой. Что маме стало плохо, и она лежит дома, и никто ей не помогает. Или ей стало нехорошо где-то в дороге, и она уже в больнице, моего сотового номера она не помнит, а городской не отвечает, потому что никого нет дома." +
            "Насмотревшись ужасных внутренних картин, я поймала такси и поехала домой. Всю дрогу я подгоняла водителя:" +
            "-Быстрее, быстрее! Неужели нельзя ехать поживее.\n" +
            "-Девушка, я и так еду на пределе возможной разрешённой скорости, - отвечал мне таксист. Я вбежала в дом, мамы не было. Я тут же позвонила мужу. Рассказывая ему ситуацию, я уже рыдала в голос. Потом я позвонила маминой родной сестре. Ну мало ли, может она что-то знала, но она тоже заволновалась и ответила, что вообще сегодня они не созванивались." +
            "Прошёл ещё один час. Муж и сын пришли домой. Они оба волновались не меньше моего, но успокаивали меня. Они убеждали, что она вот-вот вернётся, что все будет хорошо." +
            "Но мамы все не было. Минуты мне казались часами, а час вечностью. Потеряв всякую надежду увидеть свою маму живой, я взмолилась: «Господи, я прошу тебя, приведи мою мамочку домой, где бы она ни была, живой и здоровой. Если с ней что-то случилось, пошли ей людей, которые помогут. Если я что-то делала не так, вела себя неправильно по отношению к маме, дай мне знать, и я обещаю, что я сделаю все, чтобы больше этого не повторилось. Но я умоляю тебя, дай мне ещё столько времени, сколько возможно, побыть дочерью»." +
            "Мы сидели в страшном напряжении, ожидая самого плохого.\n" +
            " Но вот в замочной скважине, завозился ключ. Все были дома. Это могла быто только мама." +
            "Я подлетела к двери, и сама открыла, не дожидаясь, пока она справится с ключом. Мама была вся вымокшая, но живая и здоровая. Я, обливаясь слезами, кинулась ей в объятия." +
            "Мамочка переоделась в сухое, и я усадила ее пить горячий чай." +
            "Мама рассказала о своих приключениях.\n" +
            "Она села в автобус за час до нашей встречи и проехала свою остановку, задремав. На конечной остановке маршрута водитель тронул ее за плечо." +
            "-Бабуля, мы приехали, вам куда?" +
            "Мамочка не сразу сообразила, где она. Водитель, очень добрый мужчина, сориентировал ее. Мама стала сокрушаться, что проехала свою остановку и теперь опоздает на встречу с дочерью.\n" +
            "-Ничего, - подбодрил водитель, - сейчас поедем в обратный путь, и я сам высажу вас на нужной остановке. Можете ещё поспать. Но давайте позвоним вашей дочке с моего телефона. Ведь она, наверное, волнуется?\n" +
            "-Я не помню ее сотовый номер, - расстроилась мама.\n" +
            "Выйдя на нужной остановке, мама попала под дождь, но до места встречи все-таки дошла. Меня там, конечно, не было. Потому что от назначенного времени уже прошло почти два часа.\n" +
            "В это время я ждала ее дома и переживала. И ей конечно нужно было ехать домой, а не выходить там, где договорились встретиться.\n" +
            "Снова автобус, и снова поездка. В середине пути автобус сломался, и водитель надеялся его починить, провозился примерно полчаса. Те тридцать минут, которые мне показались вечностью! Ведь именно в это время я ждала ее дома и страдала от неизвестности. Мама знала, что я волнуюсь, но выйти и пересесть в такси она не догадалась.\n" +
            "Я благодарила Бога, что она вернулась живая и невредимая." +
            "Мне хотелось встать перед ней на колени, целовать ее руки, обнимать и говорить ей важные слова, но я не сделала этого. Почему, почему я тогда не сделала этого?" +
            "Сейчас, когда с тех прошло восемь лет, я корю себя за то, что мало уделяла ей внимания, что часто была груба, не говорила ей, как я ее люблю, и как мне хорошо с нею, что у меня нет никого дороже, чем она - моя милая, любимая мама." +
            "После того случая мама прожила ещё шесть месяцев…\n" +
            "Бог отсрочил время, и дал мне счастье побыть дочерью ещё целых полгода.\n"+ "\n"




}